Tekla.Structures.Model.PointCloudDataServices.TCProject
Represents a Trimble Connect Project tenancy with point cloud data services.
The following example shows how to use the Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices class to retrieve point cloud data in Trimble Connect projects
and attach it to a model.
using System.Threading;
using Tekla.Structures.Model;
public class Example
{
public async void Example1()
{
var projects = await PointCloudDataServices.GetProjectsWithPointCloudsAsync();
var pointClouds = projects.First().PointClouds;
var url = await PointCloudDataServices.GetPointCloudUrlAsync(projects.First(), pointClouds.First());
PointCloud pointCloud = new PointCloud
{
Name = pointClouds.First().Name,
Url = url,
TcProjectId = projects.First().Id,
TcPointCloudGuid = pointClouds.First().Id,
LocationBy = Guid.Empty,
UseAutoCreatedBasePoint = true,
Scale = 1.0
};
pointCloud.Attach();
}
}

Tekla.Structures.Model.PointCloudDataServices.TCProject.Id
Trimble Connect project ID.

Tekla.Structures.Model.PointCloudDataServices.TCProject.Name
Trimble Connect project name.

Tekla.Structures.Model.PointCloudDataServices.TCProject.ConnectRegion
Trimble Connect region for this project.

Tekla.Structures.Model.PointCloudDataServices.TCProject.PointClouds
List of point clouds associated with this project.

Tekla.Structures.Model.PointCloudDataServices.TCProject.RegionalUrl
Regional URL for this project.